app/controllers/pair_rotations_controller.rb

  def index
    authorize(PairRotation)
    pair_rotations = PairRotation.for_cohort(@cohort).order(:position).to_a
    @todays_rotation = pair_rotations.find do |rotation|
---
SELECT "pair_rotations".* FROM "pair_rotations"  WHERE "pair_rotations"."cohort_id" = 16  ORDER BY "pair_rotations"."position" ASC
SELECT  "cohorts".* FROM "cohorts"  WHERE "cohorts"."id" = $1 LIMIT 1  [["id", 16]]