app/views/layouts/_main_nav.html.haml

    - if current_user.instructor?
      - cohort = @cohort.nil? || @cohort.new_record? ? current_user.staffings.active.first.try(:cohort) : @cohort
---
SELECT "cohorts".* FROM "cohorts"
SELECT "staffings".* FROM "staffings"  WHERE "staffings"."cohort_id" = $1  [["cohort_id", 51]]

        %ul.dropdown-menu{:role => "menu"}
          - Cohort.current.order(:end_date).each do |cohort|
---
SELECT "cohorts".* FROM "cohorts"  WHERE ('2016-12-05' between start_date and end_date)  ORDER BY "cohorts"."end_date" ASC